// Требуется вычислить значение арифметического выражения,
// в записи которого могут использоваться вещественные числа,
// круглые скобки, пробелы, бинарные операции «+», «-», «*» и «/»,
// а так же функции cos(x) и sin(x). Вычисление следует проводить
// согласно синтаксису языка Delphi.
//
// Входные данные
// Входной файл INPUT.TXT содержит единственную строку, в которой
// находится запись арифметического выражения. Длина строки не превышает
// 200 символов. В строке могут содержаться любые символы.
// Гарантируется, что при корректном вычислении выражения не будет
// возникать переполнения 6-байтного вещественного типа и деления на ноль.
//
// Выходные данные
// В выходной файл OUTPUT.TXT выведите значение заданного
// арифметического выражения с точностью, не меньше 10-3.
// В том случае, когда в выражении присутствуют синтаксические ошибки,
// следует вывести «Error».

package main

func main() {

}
